InformationRegisters/ОтправкаРезюме.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОтправкаРезюме</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Письмо</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Кандидат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кандидаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтактВзаимодействия</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОтправкаРезюме/Forms/РезультатОтправки/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПрочитатьЗапись(Отказ);
	УстановитьСвойстваЭлементовФормы();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьЗапись(Отказ)
	
	МенеджерЗаписи = РегистрыСведений.ОтправкаРезюме.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Кандидат = Параметры.Кандидат;
	МенеджерЗаписи.Получатель = Параметры.Получатель;
	МенеджерЗаписи.Прочитать();
	
	Если Не МенеджерЗаписи.Выбран() Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Сведения об отправке резюме %1 получателю %2 отсутствуют.'"),
			Параметры.Кандидат, 
			Параметры.Получатель);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		Возврат;
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(МенеджерЗаписи, "Запись");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваЭлементовФормы()
	ТолькоПросмотр = Истина;
	УстановитьСвойстваЭлементовФормыДляОтправленногоРезюме();
	УстановитьСвойстваЭлементовФормыДляНеОтправленногоРезюме();
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваЭлементовФормыДляОтправленногоРезюме()
	
	Если Не Запись.Отправлено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.РезультатКартинка.Картинка = БиблиотекаКартинок.ЗеленыйШар;
	Элементы.Получатель.Заголовок = НСтр("ru = 'отправлено получателю'");
	Элементы.ДатаОтправления.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	Элементы.Комментарий.Видимость = Ложь;
	Элементы.Письмо.Видимость = ЗначениеЗаполнено(Запись.Письмо);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваЭлементовФормыДляНеОтправленногоРезюме()
	
	Если Запись.Отправлено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.РезультатКартинка.Картинка = БиблиотекаКартинок.КрасныйШар;
	Элементы.Получатель.Заголовок = НСтр("ru = 'не отправлено получателю'");
	Элементы.ДатаОтправления.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Элементы.ДатаОтправления.Заголовок = НСтр("ru = 'последняя попытка'");
	Элементы.Комментарий.Видимость = Истина;
	Элементы.Письмо.Видимость = ЗначениеЗаполнено(Запись.Письмо);
	
КонецПроцедуры

#КонецОбласти
